In [13]:
import pandas as pd
import numpy as np

In [26]:
xsl_path = '../../../../../../data visualition/sample datasets/Global Superstore.xls'

In [2]:
train = pd.read_csv('../data/p1_train.csv')
train.head(5)

,id,member_id,loan_amnt,funded_amnt,funded_amnt_inv,term,int_rate,installment,grade,sub_grade,...,hardship_payoff_balance_amount,hardship_last_payment_amount,disbursement_method,debt_settlement_flag,debt_settlement_flag_date,settlement_status,settlement_date,settlement_amount,settlement_percentage,settlement_term
0,0,NaN,32000,32000,32000.0,36 months,10.90,1046.13,B,B4,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
1,1,NaN,11500,11500,11500.0,36 months,15.80,403.18,C,C3,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
2,2,NaN,10000,10000,10000.0,36 months,6.49,306.45,A,A2,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
3,3,NaN,28000,28000,28000.0,36 months,7.69,873.42,A,A4,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
4,4,NaN,28000,28000,28000.0,60 months,17.97,710.56,D,D1,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN

In [3]:
pd.read_csv('../data/p1_train.csv',header=None).head(5)

c:\users\ashen\appdata\local\programs\python\python37\lib\site-packages\IPython\core\interactiveshell.py:3147: DtypeWarning: Columns (0,1,2,3,4,6,7,13,18,24,25,27,28,29,30,31,32,33,34,36,37,38,39,40,41,42,43,44,46,49,50,51,53,54,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,113,114,115,116,117,118,119,120,121,126,127,131,132,134,135,136,142,143,144) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,0,1,2,3,4,5,6,7,8,9,...,135,136,137,138,139,140,141,142,143,144
0,id,member_id,loan_amnt,funded_amnt,funded_amnt_inv,term,int_rate,installment,grade,sub_grade,...,hardship_payoff_balance_amount,hardship_last_payment_amount,disbursement_method,debt_settlement_flag,debt_settlement_flag_date,settlement_status,settlement_date,settlement_amount,settlement_percentage,settlement_term
1,0,NaN,32000,32000,32000.0,36 months,10.9,1046.13,B,B4,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
2,1,NaN,11500,11500,11500.0,36 months,15.8,403.18,C,C3,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
3,2,NaN,10000,10000,10000.0,36 months,6.49,306.45,A,A2,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
4,3,NaN,28000,28000,28000.0,36 months,7.69,873.42,A,A4,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN

In [4]:
pd.read_csv('../data/p1_test.csv',header=1).head(5)

,0,Unnamed: 1,20000,20000.1,20000.0,60 months,482.02,C,C5,Director Of Finance and Operations,...,Unnamed: 134,Unnamed: 135,Cash,N.1,Unnamed: 138,Unnamed: 139,Unnamed: 140,Unnamed: 141,Unnamed: 142,Unnamed: 143
0,1,NaN,7800,7800,7800.0,36 months,240.81,A,A2,Teacher,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
1,2,NaN,5000,5000,5000.0,36 months,178.24,D,D3,truck driver,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
2,3,NaN,22800,22800,22800.0,36 months,812.77,D,D3,yard supervisor,...,NaN,NaN,Cash,Y,Jan-2018,COMPLETE,Oct-2017,3628.0,45.0,1.0
3,4,NaN,25000,25000,24950.0,60 months,585.61,C,C1,Associate Professor,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
4,5,NaN,40000,40000,40000.0,60 months,902.37,C,C1,Finance manager,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN

In [5]:
# change index column
pd.read_csv('../data/p1_test.csv',index_col='id').head(5)

,member_id,loan_amnt,funded_amnt,funded_amnt_inv,term,installment,grade,sub_grade,emp_title,emp_length,...,hardship_payoff_balance_amount,hardship_last_payment_amount,disbursement_method,debt_settlement_flag,debt_settlement_flag_date,settlement_status,settlement_date,settlement_amount,settlement_percentage,settlement_term
id,,,,,,,,,,,,,,,,,,,,,
0,NaN,20000,20000,20000.0,60 months,482.02,C,C5,Director Of Finance and Operations,10+ years,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,7800,7800,7800.0,36 months,240.81,A,A2,Teacher,9 years,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,5000,5000,5000.0,36 months,178.24,D,D3,truck driver,< 1 year,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,22800,22800,22800.0,36 months,812.77,D,D3,yard supervisor,8 years,...,NaN,NaN,Cash,Y,Jan-2018,COMPLETE,Oct-2017,3628.0,45.0,1.0
4,NaN,25000,25000,24950.0,60 months,585.61,C,C1,Associate Professor,10+ years,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN

In [7]:
# read subset of columns
pd.read_csv('../data/p1_test.csv',index_col='id',usecols=['id','loan_amnt','funded_amnt',
                                                          'funded_amnt_inv','term','installment']).head(5)

    loan_amnt  funded_amnt  funded_amnt_inv        term  installment
id
0       20000        20000          20000.0   60 months       482.02
1        7800         7800           7800.0   36 months       240.81
2        5000         5000           5000.0   36 months       178.24
3       22800        22800          22800.0   36 months       812.77
4       25000        25000          24950.0   60 months       585.61

In [10]:
# handling missing na when read data
pd.read_csv('../data/p1_test.csv',index_col='id',na_values='0').head(5)

,member_id,loan_amnt,funded_amnt,funded_amnt_inv,term,installment,grade,sub_grade,emp_title,emp_length,...,hardship_payoff_balance_amount,hardship_last_payment_amount,disbursement_method,debt_settlement_flag,debt_settlement_flag_date,settlement_status,settlement_date,settlement_amount,settlement_percentage,settlement_term
id,,,,,,,,,,,,,,,,,,,,,
NaN,NaN,20000,20000,20000.0,60 months,482.02,C,C5,Director Of Finance and Operations,10+ years,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
1.0,NaN,7800,7800,7800.0,36 months,240.81,A,A2,Teacher,9 years,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
2.0,NaN,5000,5000,5000.0,36 months,178.24,D,D3,truck driver,< 1 year,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
3.0,NaN,22800,22800,22800.0,36 months,812.77,D,D3,yard supervisor,8 years,...,NaN,NaN,Cash,Y,Jan-2018,COMPLETE,Oct-2017,3628.0,45.0,1.0
4.0,NaN,25000,25000,24950.0,60 months,585.61,C,C1,Associate Professor,10+ years,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN

In [12]:
# skip blank rows
pd.read_csv('../data/p1_test.csv',index_col='id',skip_blank_lines=True).head(5)

,member_id,loan_amnt,funded_amnt,funded_amnt_inv,term,installment,grade,sub_grade,emp_title,emp_length,...,hardship_payoff_balance_amount,hardship_last_payment_amount,disbursement_method,debt_settlement_flag,debt_settlement_flag_date,settlement_status,settlement_date,settlement_amount,settlement_percentage,settlement_term
id,,,,,,,,,,,,,,,,,,,,,
0,NaN,20000,20000,20000.0,60 months,482.02,C,C5,Director Of Finance and Operations,10+ years,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,7800,7800,7800.0,36 months,240.81,A,A2,Teacher,9 years,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,5000,5000,5000.0,36 months,178.24,D,D3,truck driver,< 1 year,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,22800,22800,22800.0,36 months,812.77,D,D3,yard supervisor,8 years,...,NaN,NaN,Cash,Y,Jan-2018,COMPLETE,Oct-2017,3628.0,45.0,1.0
4,NaN,25000,25000,24950.0,60 months,585.61,C,C1,Associate Professor,10+ years,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN

In [16]:
# skip rows
pd.read_csv('../data/p1_test.csv',skiprows=np.arange(20)).head(5)

,19,Unnamed: 1,19000,19000.1,19000.0,36 months,583.37,A,A2,QUALITY MANAGER,...,Unnamed: 134,Unnamed: 135,Cash,N.1,Unnamed: 138,Unnamed: 139,Unnamed: 140,Unnamed: 141,Unnamed: 142,Unnamed: 143
0,20,NaN,19300,19300,19300.0,36 months,656.54,C,C3,Program Manager,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
1,21,NaN,10000,10000,10000.0,36 months,336.90,B,B4,LabCorp Of America,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
2,22,NaN,35000,35000,35000.0,60 months,999.38,F,F3,Helmerich & Payne IDC,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
3,23,NaN,28000,28000,27750.0,36 months,929.87,B,B5,System Analyst,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
4,24,NaN,10000,10000,10000.0,36 months,332.10,B,B3,team lead,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN

In [18]:
# skip rows from bottom of file
pd.read_csv('../data/p1_test.csv',engine='python',skipfooter=3).tail(5)

,id,member_id,loan_amnt,funded_amnt,funded_amnt_inv,term,installment,grade,sub_grade,emp_title,...,hardship_payoff_balance_amount,hardship_last_payment_amount,disbursement_method,debt_settlement_flag,debt_settlement_flag_date,settlement_status,settlement_date,settlement_amount,settlement_percentage,settlement_term
226059,226059,NaN,14000,14000,14000.0,60 months,335.35,C,C5,Area Mananger,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
226060,226060,NaN,30000,30000,30000.0,36 months,1032.20,C,C2,Court Attorney,...,NaN,NaN,DirectPay,N,NaN,NaN,NaN,NaN,NaN,NaN
226061,226061,NaN,12000,12000,12000.0,36 months,386.82,B,B2,NaN,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
226062,226062,NaN,16000,16000,16000.0,60 months,361.52,B,B5,Anderson Honda,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
226063,226063,NaN,12000,12000,12000.0,60 months,307.93,D,D5,Correction officer,...,NaN,NaN,Cash,Y,Aug-2018,ACTIVE,Jul-2018,5463.55,45.0,14.0

In [19]:
# read subset of file
pd.read_csv('../data/p1_test.csv',nrows=5)

,id,member_id,loan_amnt,funded_amnt,funded_amnt_inv,term,installment,grade,sub_grade,emp_title,...,hardship_payoff_balance_amount,hardship_last_payment_amount,disbursement_method,debt_settlement_flag,debt_settlement_flag_date,settlement_status,settlement_date,settlement_amount,settlement_percentage,settlement_term
0,0,NaN,20000,20000,20000.0,60 months,482.02,C,C5,Director Of Finance and Operations,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
1,1,NaN,7800,7800,7800.0,36 months,240.81,A,A2,Teacher,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
2,2,NaN,5000,5000,5000.0,36 months,178.24,D,D3,truck driver,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN
3,3,NaN,22800,22800,22800.0,36 months,812.77,D,D3,yard supervisor,...,NaN,NaN,Cash,Y,Jan-2018,COMPLETE,Oct-2017,3628.0,45.0,1.0
4,4,NaN,25000,25000,24950.0,60 months,585.61,C,C1,Associate Professor,...,NaN,NaN,Cash,N,NaN,NaN,NaN,NaN,NaN,NaN

In [27]:
# read from excel file
pd.read_excel(xsl_path,index_col='Row ID',nrows=10)

,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,City,State,Country,...,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit,Shipping Cost,Order Priority
Row ID,,,,,,,,,,,,,,,,,,,,,
32298,CA-2012-124891,2012-07-31,2012-07-31,Same Day,RH-19495,Rick Hansen,Consumer,New York City,New York,United States,...,TEC-AC-10003033,Technology,Accessories,Plantronics CS510 - Over-the-Head monaural Wir...,2309.650,7,0.0,762.1845,933.57,Critical
26341,IN-2013-77878,2013-02-05,2013-02-07,Second Class,JR-16210,Justin Ritter,Corporate,Wollongong,New South Wales,Australia,...,FUR-CH-10003950,Furniture,Chairs,"Novimex Executive Leather Armchair, Black",3709.395,9,0.1,-288.7650,923.63,Critical
25330,IN-2013-71249,2013-10-17,2013-10-18,First Class,CR-12730,Craig Reiter,Consumer,Brisbane,Queensland,Australia,...,TEC-PH-10004664,Technology,Phones,"Nokia Smart Phone, with Caller ID",5175.171,9,0.1,919.9710,915.49,Medium
13524,ES-2013-1579342,2013-01-28,2013-01-30,First Class,KM-16375,Katherine Murray,Home Office,Berlin,Berlin,Germany,...,TEC-PH-10004583,Technology,Phones,"Motorola Smart Phone, Cordless",2892.510,5,0.1,-96.5400,910.16,Medium
47221,SG-2013-4320,2013-11-05,2013-11-06,Same Day,RH-9495,Rick Hansen,Consumer,Dakar,Dakar,Senegal,...,TEC-SHA-10000501,Technology,Copiers,"Sharp Wireless Fax, High-Speed",2832.960,8,0.0,311.5200,903.04,Critical
22732,IN-2013-42360,2013-06-28,2013-07-01,Second Class,JM-15655,Jim Mitchum,Corporate,Sydney,New South Wales,Australia,...,TEC-PH-10000030,Technology,Phones,"Samsung Smart Phone, with Caller ID",2862.675,5,0.1,763.2750,897.35,Critical
30570,IN-2011-81826,2011-11-07,2011-11-09,First Class,TS-21340,Toby Swindell,Consumer,Porirua,Wellington,New Zealand,...,FUR-CH-10004050,Furniture,Chairs,"Novimex Executive Leather Armchair, Adjustable",1822.080,4,0.0,564.8400,894.77,Critical
31192,IN-2012-86369,2012-04-14,2012-04-18,Standard Class,MB-18085,Mick Brown,Consumer,Hamilton,Waikato,New Zealand,...,FUR-TA-10002958,Furniture,Tables,"Chromcraft Conference Table, Fully Assembled",5244.840,6,0.0,996.4800,878.38,High
40155,CA-2014-135909,2014-10-14,2014-10-21,Standard Class,JW-15220,Jane Waco,Corporate,Sacramento,California,United States,...,OFF-BI-10003527,Office Supplies,Binders,Fellowes PB500 Electric Punch Plastic Comb Bin...,5083.960,5,0.2,1906.4850,867.69,Low
40936,CA-2012-116638,2012-01-28,2012-01-31,Second Class,JH-15985,Joseph Holt,Consumer,Concord,North Carolina,United States,...,FUR-TA-10000198,Furniture,Tables,Chromcraft Bull-Nose Wood Oval Conference Tabl...,4297.644,13,0.4,-1862.3124,865.74,Critical

In [29]:
# specify sheet should be read
pd.read_excel(xsl_path,index_col='Row ID',sheet_name='Orders',nrows=10)

,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,City,State,Country,...,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit,Shipping Cost,Order Priority
Row ID,,,,,,,,,,,,,,,,,,,,,
32298,CA-2012-124891,2012-07-31,2012-07-31,Same Day,RH-19495,Rick Hansen,Consumer,New York City,New York,United States,...,TEC-AC-10003033,Technology,Accessories,Plantronics CS510 - Over-the-Head monaural Wir...,2309.650,7,0.0,762.1845,933.57,Critical
26341,IN-2013-77878,2013-02-05,2013-02-07,Second Class,JR-16210,Justin Ritter,Corporate,Wollongong,New South Wales,Australia,...,FUR-CH-10003950,Furniture,Chairs,"Novimex Executive Leather Armchair, Black",3709.395,9,0.1,-288.7650,923.63,Critical
25330,IN-2013-71249,2013-10-17,2013-10-18,First Class,CR-12730,Craig Reiter,Consumer,Brisbane,Queensland,Australia,...,TEC-PH-10004664,Technology,Phones,"Nokia Smart Phone, with Caller ID",5175.171,9,0.1,919.9710,915.49,Medium
13524,ES-2013-1579342,2013-01-28,2013-01-30,First Class,KM-16375,Katherine Murray,Home Office,Berlin,Berlin,Germany,...,TEC-PH-10004583,Technology,Phones,"Motorola Smart Phone, Cordless",2892.510,5,0.1,-96.5400,910.16,Medium
47221,SG-2013-4320,2013-11-05,2013-11-06,Same Day,RH-9495,Rick Hansen,Consumer,Dakar,Dakar,Senegal,...,TEC-SHA-10000501,Technology,Copiers,"Sharp Wireless Fax, High-Speed",2832.960,8,0.0,311.5200,903.04,Critical
22732,IN-2013-42360,2013-06-28,2013-07-01,Second Class,JM-15655,Jim Mitchum,Corporate,Sydney,New South Wales,Australia,...,TEC-PH-10000030,Technology,Phones,"Samsung Smart Phone, with Caller ID",2862.675,5,0.1,763.2750,897.35,Critical
30570,IN-2011-81826,2011-11-07,2011-11-09,First Class,TS-21340,Toby Swindell,Consumer,Porirua,Wellington,New Zealand,...,FUR-CH-10004050,Furniture,Chairs,"Novimex Executive Leather Armchair, Adjustable",1822.080,4,0.0,564.8400,894.77,Critical
31192,IN-2012-86369,2012-04-14,2012-04-18,Standard Class,MB-18085,Mick Brown,Consumer,Hamilton,Waikato,New Zealand,...,FUR-TA-10002958,Furniture,Tables,"Chromcraft Conference Table, Fully Assembled",5244.840,6,0.0,996.4800,878.38,High
40155,CA-2014-135909,2014-10-14,2014-10-21,Standard Class,JW-15220,Jane Waco,Corporate,Sacramento,California,United States,...,OFF-BI-10003527,Office Supplies,Binders,Fellowes PB500 Electric Punch Plastic Comb Bin...,5083.960,5,0.2,1906.4850,867.69,Low
40936,CA-2012-116638,2012-01-28,2012-01-31,Second Class,JH-15985,Joseph Holt,Consumer,Concord,North Carolina,United States,...,FUR-TA-10000198,Furniture,Tables,Chromcraft Bull-Nose Wood Oval Conference Tabl...,4297.644,13,0.4,-1862.3124,865.74,Critical

In [30]:
# read multiple sheets
GSS = pd.ExcelFile(xsl_path)
GSS.sheet_names

['Orders', 'Returns', 'People']

In [31]:
GSS.parse('Returns')

     Returned         Order ID         Market
0         Yes   MX-2013-168137          LATAM
1         Yes   US-2011-165316          LATAM
2         Yes  ES-2013-1525878             EU
3         Yes   CA-2013-118311  United States
4         Yes  ES-2011-1276768             EU
...       ...              ...            ...
1168      Yes  ES-2013-2639112             EU
1169      Yes   CA-2014-134194  United States
1170      Yes  ES-2012-3246286             EU
1171      Yes  ES-2012-4379168             EU
1172      Yes   CA-2014-168193  United States

[1173 rows x 3 columns]

In [32]:
# skip rows from anywhere and bottom
pd.read_excel(xsl_path,skiprows=12,skipfooter=12,sheet_name='Returns')

      Yes    ID-2011-20989           APAC
0     Yes  ES-2013-3323529             EU
1     Yes   MX-2014-135328          LATAM
2     Yes    IN-2012-63934           APAC
3     Yes    IN-2014-43039           APAC
4     Yes   CA-2012-150875  United States
...   ...              ...            ...
1144  Yes   US-2014-105046  United States
1145  Yes    IN-2014-52384           APAC
1146  Yes    IN-2011-36074           APAC
1147  Yes  ES-2013-2745392             EU
1148  Yes   MX-2014-154480          LATAM

[1149 rows x 3 columns]

In [34]:
# choosing columns to read
pd.read_excel(xsl_path,sheet_name='Orders',usecols=['Order ID','Order Date','Ship Date','Ship Mode','Customer ID'])

              Order ID Order Date  Ship Date       Ship Mode Customer ID
0       CA-2012-124891 2012-07-31 2012-07-31        Same Day    RH-19495
1        IN-2013-77878 2013-02-05 2013-02-07    Second Class    JR-16210
2        IN-2013-71249 2013-10-17 2013-10-18     First Class    CR-12730
3      ES-2013-1579342 2013-01-28 2013-01-30     First Class    KM-16375
4         SG-2013-4320 2013-11-05 2013-11-06        Same Day     RH-9495
...                ...        ...        ...             ...         ...
51285    IN-2014-62366 2014-06-19 2014-06-19        Same Day    KE-16420
51286   US-2014-102288 2014-06-20 2014-06-24  Standard Class    ZC-21910
51287   US-2013-155768 2013-12-02 2013-12-02        Same Day    LB-16795
51288   MX-2012-140767 2012-02-18 2012-02-22  Standard Class    RB-19795
51289   MX-2012-134460 2012-05-22 2012-05-26    Second Class    MC-18100

[51290 rows x 5 columns]